### First Function

create function compute area

In [3]:
def computeCircleArea(radius):
    pi = 3.14
    area = pi * (radius**2)
    return area

call function

In [6]:
area = computeCircleArea(20)
print("The area is ",area)

The area is  1256.0

### Object Type

In [7]:
type("Hallo") # string

str

In [8]:
type(2) # integer

int

In [10]:
type(2.3) # double / float

float

In [12]:
type([4,5,6]) # list

list

In [13]:
type((4,5,6)) # tuple

tuple

### Variable

In [14]:
income = 500
consumption = 25
num_of_salary_ann = 12
monthly_working_days = 25

In [17]:
saving = income - consumption
print(saving)

475

In [21]:
annual_income = income * num_of_salary_ann
daily_income = annual_income / monthly_working_days

Create Function DS

In [25]:
def DSBusiness():
    print("PACMANN AI")

In [26]:
DSBusiness()

PACMANN AI

While and For Loop

In [28]:
def repeatDSBusiness():
    x = 1
    while x < 5:
        DSBusiness()
        x = x+1

In [30]:
repeatDSBusiness()

PACMANN AI
PACMANN AI
PACMANN AI
PACMANN AI

In [39]:
A = 5==5
B = 5!=5

In [40]:
print(A,B)

True False

In [67]:
customer = [{
    "Name": ["Krisna"],
    "Address": ["Salemba"]
}]

customer[0]["Name"].append("Adit")
for i in customer:
    print(i["Name"])

['Krisna', 'Adit']

### Machine Learning Package is Starting

In [64]:
import pandas as pd

In [74]:
customer = {
    "Name": ["Krisna", "Adit"],
    "Address": ["Salemba", "Jaya"]
}

In [69]:
pd.DataFrame(customer)

   Address    Name
0  Salemba  Krisna
1     Jaya    Adit

In [78]:
customers = [{
    "Name": "Krisna",
    "Address": "Salemba"
}]

customers.append({
    "Name": "Muhammad",
    "Address": "Cisauk"
})

pd.DataFrame(customers)

   Address      Name
0  Salemba    Krisna
1   Cisauk  Muhammad

In [77]:
customerObject = {
    "Data 1": {
        "Name": "Krisna",
        "Address": "Salemba"
    },
    "Data 2": {
        "Name": "Fahry",
        "Address": "Tangsel"
    }
}

pd.DataFrame(customerObject)

          Data 1   Data 2
Address  Salemba  Tangsel
Name      Krisna    Fahry

##### Visualization with pandas

- Plotting is used to show out layer data
- To Understand Data (check distribution data)
- Computational is Cheap
- Descriptive Stats might Wrong

In [82]:
#Read file CSV with pandas
hr_df = pd.read_csv("hr_data.csv", sep=";")

In [84]:
hr_df[:10]

,Unnamed: 0,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,division,salary
0,0,NaN,0.53,2,157,3,0,1,0,sales,NaN
1,1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,2,0.11,NaN,7,272,4,0,1,0,NaN,medium
3,3,0.72,0.87,5,223,5,0,1,0,sales,low
4,4,0.37,0.52,2,159,3,0,1,0,sales,low
5,5,0.41,0.50,2,153,3,0,1,0,sales,low
6,6,0.10,0.77,6,247,4,0,1,0,sales,low
7,7,0.92,0.85,5,259,5,0,1,0,sales,low
8,8,0.89,1.00,5,224,5,0,1,0,sales,low
9,9,0.42,0.53,2,142,3,0,1,0,sales,low

### Preprocessing Data

- Import Dataset
- Explore Data
- Missing Data
- Imputation

#### Import Dataset

In [90]:
import pandas as pd

#### Show Documentation Function

In [97]:
# SHIFT + Tab

In [98]:
pd.read_csv?

#### Explore Data

In [103]:
data = pd.read_csv("hr_data.csv",sep=";")

###### Show Sample Data

In [109]:
data.head()

,Unnamed: 0,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,division,salary
0,0,NaN,0.53,2,157,3,0,1,0,sales,NaN
1,1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,2,0.11,NaN,7,272,4,0,1,0,NaN,medium
3,3,0.72,0.87,5,223,5,0,1,0,sales,low
4,4,0.37,0.52,2,159,3,0,1,0,sales,low

In [110]:
data.tail()

,Unnamed: 0,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,division,salary
14994,14994,0.40,NaN,2,151,3,0,1,0,support,low
14995,14995,0.37,NaN,2,160,3,0,1,0,support,low
14996,14996,0.37,NaN,2,143,3,0,1,0,support,low
14997,14997,0.11,NaN,6,280,4,0,1,0,support,low
14998,14998,0.37,NaN,2,158,3,0,1,0,support,low

###### Check row and column data

In [111]:
data.shape

(14999, 11)

###### Show Columns Data

In [112]:
data.columns

Index(['Unnamed: 0', 'satisfaction_level', 'last_evaluation', 'number_project',
       'average_montly_hours', 'time_spend_company', 'Work_accident', 'left',
       'promotion_last_5years', 'division', 'salary'],
      dtype='object')

###### Value Counts and Proportion

In [114]:
data["left"].value_counts()

0    11428
1     3571
Name: left, dtype: int64

In [118]:
data["left"].value_counts(normalize=True)

0    0.761917
1    0.238083
Name: left, dtype: float64

###### Duplicated Data

In [122]:
#check shape
data.duplicated().sum()

0

###### Checking missing data

In [123]:
data.isnull().sum()

Unnamed: 0                 0
satisfaction_level       228
last_evaluation          128
number_project             0
average_montly_hours       0
time_spend_company         0
Work_accident              0
left                       0
promotion_last_5years      0
division                 105
salary                   110
dtype: int64

###### Handling Missing Values

- Drop
- Imputation

###### Drop Missing Value

In [126]:
data_hr_empty = data.dropna(axis=0) # axis = 0 is row , 1 is column

In [127]:
data_hr_empty.isnull().sum()

Unnamed: 0               0
satisfaction_level       0
last_evaluation          0
number_project           0
average_montly_hours     0
time_spend_company       0
Work_accident            0
left                     0
promotion_last_5years    0
division                 0
salary                   0
dtype: int64

In [128]:
data.shape

(14999, 11)

In [129]:
data_hr_empty.shape

(14430, 11)

###### Imputation Missing Value

Have two ways to imputation missing value because:
- Salary, Division is categorical
- last_evaluation is numerical

In [150]:
data.isnull().sum()

Unnamed: 0                 0
satisfaction_level       228
last_evaluation          128
number_project             0
average_montly_hours       0
time_spend_company         0
Work_accident              0
left                       0
promotion_last_5years      0
division                 105
salary                   110
dtype: int64

###### Prepare Columns that needed and  Split Columns by Type

In [153]:
data_output = data["left"] #get column left
data_input = data.drop(["left"], axis=1) #drop output column frm data

In [154]:
data_output.head()

0    1
1    1
2    1
3    1
4    1
Name: left, dtype: int64

In [156]:
data_input = data_input.drop(["Unnamed: 0"], axis=1) #drop column Unnamed: 0

In [157]:
data_input.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,promotion_last_5years,division,salary
0,NaN,0.53,2,157,3,0,0,sales,NaN
1,0.80,0.86,5,262,6,0,0,sales,medium
2,0.11,NaN,7,272,4,0,0,NaN,medium
3,0.72,0.87,5,223,5,0,0,sales,low
4,0.37,0.52,2,159,3,0,0,sales,low

In [159]:
data_input.isnull().sum()

satisfaction_level       228
last_evaluation          128
number_project             0
average_montly_hours       0
time_spend_company         0
Work_accident              0
promotion_last_5years      0
division                 105
salary                   110
dtype: int64

###### get numerical column

In [169]:
data_numerical = data_input._get_numeric_data()

In [170]:
data_numerical.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,promotion_last_5years
0,NaN,0.53,2,157,3,0,0
1,0.80,0.86,5,262,6,0,0
2,0.11,NaN,7,272,4,0,0
3,0.72,0.87,5,223,5,0,0
4,0.37,0.52,2,159,3,0,0

In [171]:
num_cat = ["Work_accident","promotion_last_5years"]

In [172]:
data_numerical = data_numerical.drop(num_cat, axis=1)
data_numerical.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company
0,NaN,0.53,2,157,3
1,0.80,0.86,5,262,6
2,0.11,NaN,7,272,4
3,0.72,0.87,5,223,5
4,0.37,0.52,2,159,3

In [176]:
numerical = data_numerical.columns
data_categorical = data_input.drop(numerical, axis=1)
data_categorical.head()

   Work_accident  promotion_last_5years division  salary
0              0                      0    sales     NaN
1              0                      0    sales  medium
2              0                      0      NaN  medium
3              0                      0    sales     low
4              0                      0    sales     low

###### Missing Values imputation: Numerical

In [179]:
from sklearn.preprocessing import Imputer

In [181]:
imput = Imputer(missing_values="NaN", strategy="median")

In [182]:
imput.fit(data_numerical)

Imputer(axis=0, copy=True, missing_values='NaN', strategy='median', verbose=0)

In [183]:
data_numerical.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company
0,NaN,0.53,2,157,3
1,0.80,0.86,5,262,6
2,0.11,NaN,7,272,4
3,0.72,0.87,5,223,5
4,0.37,0.52,2,159,3

###### Imputation Process

In [186]:
data_numerical_imputed = pd.DataFrame(imput.transform(data_numerical))
data_numerical_imputed.columns = data_numerical.columns
data_numerical_imputed.index = data_numerical.index

In [187]:
data_numerical_imputed.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company
0,0.65,0.53,2.0,157.0,3.0
1,0.80,0.86,5.0,262.0,6.0
2,0.11,0.72,7.0,272.0,4.0
3,0.72,0.87,5.0,223.0,5.0
4,0.37,0.52,2.0,159.0,3.0

In [188]:
data_numerical_imputed.isnull().sum()

satisfaction_level      0
last_evaluation         0
number_project          0
average_montly_hours    0
time_spend_company      0
dtype: int64

###### Missing Values imputation: Categorical

In [189]:
data_categorical.isnull().sum()

Work_accident              0
promotion_last_5years      0
division                 105
salary                   110
dtype: int64

In [190]:
data_categorical_imputed = data_categorical.fillna("KOSONG")
data_categorical_imputed.head()

   Work_accident  promotion_last_5years division  salary
0              0                      0    sales  KOSONG
1              0                      0    sales  medium
2              0                      0   KOSONG  medium
3              0                      0    sales     low
4              0                      0    sales     low

In [194]:
data_input_clean = pd.concat([data_numerical_imputed , data_categorical_imputed], axis=1)

In [195]:
data_input_clean.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,promotion_last_5years,division,salary
0,0.65,0.53,2.0,157.0,3.0,0,0,sales,KOSONG
1,0.80,0.86,5.0,262.0,6.0,0,0,sales,medium
2,0.11,0.72,7.0,272.0,4.0,0,0,KOSONG,medium
3,0.72,0.87,5.0,223.0,5.0,0,0,sales,low
4,0.37,0.52,2.0,159.0,3.0,0,0,sales,low

In [196]:
data_clean = pd.concat([data_input_clean, data_output], axis=1)
data_clean.head()

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,promotion_last_5years,division,salary,left
0,0.65,0.53,2.0,157.0,3.0,0,0,sales,KOSONG,1
1,0.80,0.86,5.0,262.0,6.0,0,0,sales,medium,1
2,0.11,0.72,7.0,272.0,4.0,0,0,KOSONG,medium,1
3,0.72,0.87,5.0,223.0,5.0,0,0,sales,low,1
4,0.37,0.52,2.0,159.0,3.0,0,0,sales,low,1

Save Data to CSV

In [197]:
data_clean.to_csv("hr_data_clean.csv")